[
  {
    "company_link": "https://www.dice.com/company/cxhlnc?companyname=Yoh%20-%20A%20Day%20%26%20Zimmerman%20Company",
    "location": "Remote or Nantou County, Taiwan",
    "timestamp": "2024-07-18 22:18:36.868761",
    "posted_date": "Posted 6 hours ago",
    "employment_type": "Full-time",
    "company_image": "https://d3qscgr6xsioh.cloudfront.net/WieLG74uTrWnsRB8I5ud_0a3f6c37697252d795992679076a2678.png?format=webp",
    "company": "Yoh - A Day & Zimmerman Company",
    "link": "https://www.dice.com/job-detail/5b997e14-1e17-4bce-a78d-60b460279f35",
    "description": "Materials Program Manager (MPM) - Taiwan\nLooking for a solid Materials Program Manager to support an autonomous vehicle companies Supply Chain department. This person should have a background in materials planning and understand the key vendors involved in electronics components, mechanical components, automotive components, etc.\nThe key responsibility for this job will be\nmanual demand planning (Manual MRP experience)\n. There is no SAP, ERP, or SW suite that will be utilized, this is all\nmanual production planning/Manual MRP s\nthrough Excel/GSheets, so advanced Excel or GSheet s experience is a must have.\nScope:\nStrong understanding of the\nClear To Build\nreport AKA\nCTB\n. Some companies call it a\nshortage report or build status report\n. This is the MPM's primary task which will be focused on. Note: CTB  Clear to Build  is essentially an\nMRP\n.\nBuilding stuff in batches/batch building aka Batch Production, job production, lot production, etc. are all additional terms associated with CTB/MRP s.\nExperience with\nManual Demand Planning\n,\nManual Production Planning\n,\nManual MRP\nis the key requirement.\nDegree in Supply Chain or similar is ideal.\nAnalyze manufacturing build plans against inventory/supply chain data in order to determine demand for materials replenishment.\nRetrieve quotes from suppliers & submit PO s.\nManage delivery schedules in order to ensure materials arrive ahead of required dates.\nTrack/Mitigate Excess and Obsolescence.\nRequired:\nStrong understanding of the\nClear To Build\nreport AKA\nCTB\n. Some companies call it a\nshortage report or build status report\n. Note: CTB  Clear to Build  is essentially an\nMRP\n.\nBuilding stuff in batches/batch building aka Batch Production, job production, lot production, etc. are all additional terms associated with CTB/MRP s.\nExperience with\nManual Demand Planning\n,\nManual Production Planning\n,\nManual MRP\nis the key requirement.\nAdvanced spreadsheet / Excel skills; Ability to generate complex dashboards, tools, and reports. Experience with excel formulas like - VLOOKUP, SUMIF, COUNTIF, IFERROR, INDEX, MATCH, MIN, etc.\nSolid experience working as a Materials PM, Buyer/Planner, Materials Planners, or similar.\nUnderstand how to read and understand bill of materials (BOM s) and manage inventory accuracy.\nStrong knowledge of MRP (Materials Requirements Planning) system functionality.\nEstimated Min Rate\n: $NaN\nEstimated Max Rate\n: $NaN\nNote: Any pay ranges displayed are estimations.  Actual pay is determined by an applicant's experience, technical expertise, and other qualifications as listed in the job description.  All qualified applicants are welcome to apply.\nYoh, a Day & Zimmermann company, is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\nVisit\nto contact us if you are an individual with a disability and require accommodation in the application process.",
    "id": "dice_5b997e14-1e17-4bce-a78d-60b460279f35",
    "title": "Materials Program Manager (MPM) - Taiwan"
  },
  {
    "company_link": "https://www.dice.com/company/10217011?companyname=Trimble%20Mobile%20Solutions",
    "location": "Remote or Ohio, USA",
    "timestamp": "2024-07-18 22:12:43.238906",
    "posted_date": "Posted 12 hours ago",
    "employment_type": "Full-time",
    "company_image": "https://assets.dice.com/external/images/empLogos/42652largeLogo.gif",
    "company": "Trimble Mobile Solutions",
    "link": "https://www.dice.com/job-detail/6f2250fb-5309-4308-ac8d-acc93878faf3",
    "description": "Position Overview\nWe are seeking an experienced Front-End Engineer to join our team. If you are passionate about simplifying complex problems, love the React ecosystem, and value good front-end architecture, this role is for you. As a Front-End Engineer, you will play a pivotal role in our team, focusing on the development of new features, maintaining the application, debugging, and problem-solving. You will also be responsible for ensuring the quality of new features. This position offers an excellent opportunity to deepen and expand your knowledge of front-end development, particularly in React and TypeScript. We are looking for a high-energy, hard-working, and enthusiastic individual who is ready to contribute significantly to our rapidly growing code base. If you are eager to make a substantial impact in one of the world's largest industries, we would love to hear from you.\nWhat You Will Do\nDevelop and maintain and scale our main UI application using React and TypeScript\nCollaborate with design and product teams to implement user interfaces and features.\nRegularly review the design system and propose improvements and updates, including new components or features.\nWrite clean, maintainable code and adhere to best practices in software development.\nParticipate in code reviews and provide constructive feedback to other team members.\nImplement automated tests to ensure functionality and maintain high quality.\nTroubleshoot and debug issues to ensure smooth performance of our applications.\nStay up-to-date with the latest trends and technologies in web development.\nYour Mission\nContinually enhance your proficiency in React, TypeScript, CSS, HTML, and architectural design and implementation.\nStrive to be an exceptional team member, focusing on the development of high-quality, maintainable, and scalable features.\nCollaborate closely with the Lead Engineer to define requirements, develop implementation plans, establish timelines, work with designers, create visually appealing elements, integrate with backend APIs, manage application state, and conduct thorough testing before release.\nWork in synergy with the engineering, product, and design teams to set objectives and design functional, cohesive code that enhances the user experience.\nEngage in ongoing education and training to stay updated on industry best practices and learn new programming languages.\nUphold a high standard of quality and reliability in the product performance.\nEnsure the quality of the product through scalable automated and manual testing methodologies.\nWhat Skills and Experience You Should Bring\nWorking understanding of React, Typescript, HTML, CSS, Git, REST APIs, UI testing (end to end and unit testing)\nNice to have understanding: Component libraries and other open-source projects, Functional Programming, UI/UX design, NodeJS, SQL, relational databases, design, utilizing a debugger\nFullstack development with Java/.Net technology would be a plus\nFamiliarity with graphic design applications such as Figma, InVision, Adobe XD, Sketch, etc.\nWorking understanding of the Agile development cycle & programming techniques & tools for modern Web-based applications.\nFocus on efficiency, user experience, & process improvement\nExcellent project & time management skills\nStrong problem solving, verbal & written communication skills\nWithin the first month, you will\nUnderstand high-level freight workflows\nUnderstand high-level technical architecture and capabilities\nGet to know teammates and understand current workflow\nGet familiar with code structure and deployment practices\nBegin tandem development with the current team on small features\nIdentify goals, key metrics, and plans to achieve them\nWithin the first 3 months, you will\nBe comfortable navigating and manipulating the codebase\nBe able to take feature requests and work with the Lead Engineer to create specs and timelines\nBe able to influence architectural decisions with the help of the engineering team\nWithin the first 6 months, you will\nMake consistent, meaningful contributions to the frontend codebase\nIndependently work with the product manager to design, build and deploy larger features\nHave a great understanding of the codebase as you continue to grow and expand in your role as Front-End Engineer\nGrow your career personally and professionally\n-\nPay Equity\n-\nTrimble provides the following compensation range and general description of other compensation and benefits that it in good faith believes it might pay and/or offer for this position. This compensation range is based on a full time schedule. Trimble reserves the right to ultimately pay more or less than the posted range and offer additional benefits and other compensation, depending on circumstances not related to an applicant's sex or other status protected by local, state, or federal law.\n-\nHiring Range:\n115700\n-\n156100\n-\nBonus Eligible?\nYes\n-\nTrimble offers comprehensive core benefits that include Medical, Dental, Vision, Life, Disability, Time off plans and retirement plans. Most of our businesses also offer tax savings plans for health, dependent care and commuter expenses as well as Paid Parental Leave and Employee Stock Purchase Plan.\n-\nTrimble is proud to be an equal opportunity employer. We welcome and embrace our\ncandidates' diversity and take affirmative action to employ and advance individuals\nwithout regard to race, color, sex, gender identity or expression, sexual orientation,\nreligion, age, physical or mental disability, veteran status, pregnancy (including\nchildbirth or related medical conditions), national origin, marital status, genetic\ninformation, and all other legally protected characteristics. We forbid discrimination and\nharassment in the workplace based on any protected status or characteristic. A criminal\nhistory is not an automatic bar to employment with the Company, and we consider\nqualified applicants consistent with applicable federal, state, and local law.\nThe Company is also committed to providing reasonable accommodations for\nindividuals with disabilities, and individuals with sincerely held religious beliefs in our job\napplication procedures. If you need assistance or an accommodation for your job,  contact",
    "id": "dice_6f2250fb-5309-4308-ac8d-acc93878faf3",
    "title": "Senior Software Engineer"
  },
  {
    "company_link": "https://www.dice.com/company/101054TS?companyname=TEKsystems%20c%2Fo%20Allegis%20Group",
    "location": "Remote or Downers Grove, Illinois, USA",
    "timestamp": "2024-07-18 22:12:43.220396",
    "posted_date": "Posted 9 hours ago",
    "employment_type": "Full-time",
    "company_image": "https://assets.dice.com/external/images/empLogos/313d6470c642f8bad83efdf8d3ee20ff.png",
    "company": "TEKsystems c/o Allegis Group",
    "link": "https://www.dice.com/job-detail/3ccf16bc-be70-4f7d-b382-b641084fb3b3",
    "description": "Descriptio\nSoftware Engineer. W2. CAD and Three.JS. REMOTE.\nTop Skills' Details\n1. CAD\n2. Three.JS\n3. Typescript\nNice to have: GLTF\nLooking for candidates with CAD data rendering.\nOpen to talk to candidates with OpenGL experience but must have CAD rendering experience. 50/50, or 70% CAD, 30% ThreeJS.\nIf someone has a great experience in rendering large assemblies in CAD, but 5-10% ThreeJS that's ok,\nSkills:\nThree.js, React, CAD, 3D Visulization, dassault systems solidworks, autodesk, cad data, react.js, angularjs, opengl\nAbout TEKsystems:\nWe're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company.\nThe company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.",
    "id": "dice_3ccf16bc-be70-4f7d-b382-b641084fb3b3",
    "title": "Software Engineer (CAD, Three.JS)- Remote, W2"
  },
  {
    "company_link": "https://www.dice.com/company/RTX15189b?companyname=SAS%20Institute%20Inc",
    "location": "Remote or US",
    "timestamp": "2024-07-18 22:18:36.513317",
    "posted_date": "Posted 6 hours ago",
    "employment_type": "Full-time",
    "company_image": "https://d3qscgr6xsioh.cloudfront.net/u2W7y9viTOWuv6dRFCYq_transformed.png?format=webp",
    "company": "SAS Institute Inc",
    "link": "https://www.dice.com/job-detail/c81dad63-c31e-4173-812a-146dc92f470d",
    "description": "Senior Software Developer - Remote or Hybrid\nNice to meet you!\nWe're a leader in data and AI. Through our software and services, we inspire customers around the world to transform data into intelligence - and questions into answers.\nWe're also a debt-free multi-billion-dollar organization on our path to IPO-readiness. If you're looking for a dynamic, fulfilling career coupled with flexibility and world-class employee experience, you'll find it here.\nAbout the job\nThe Customer Intelligence R&D team is looking for a\nSenior Software Developer\nto advance our data engineering framework, support numerous value-stream teams, and more.\nData Engineering is looking to the future, and how we can best support our customers both internal and external by leveraging the latest in Generative AI within our solutions. Data pipelines, data management, as well as job orchestration and additional manipulation of customer event data will fall within your scope of influence.\nYou will contribute to various solutions driven by the technical acumen you bring. Your experience will contribute to the overall success of the team via interactions with other teams we support as well as mentoring junior team members within the team. Expertise within one or more areas of the product software is expected to be gained expeditiously.\nThe Data Engineering team hosting this position is a multi-talented feature team contributing to diverse technologies powering our Customer Intelligence CI360 solutions.\nAs a Senior Software Developer, you will:\nDesign and develop high-quality, testable, and scalable software solutions within established timelines while adhering to CI360 best practices and processes\nActively involve other project stakeholders (e.g. managers, developers, user interface and visual designers, and product managers) to ensure implementations satisfy the functional requirements\nEnsure solutions meet the highest data security guidelines and are consistent with R&D standards\nDevelop multi-tenancy solutions that support multiple services and scale seamlessly\nExpand knowledge of CI360 solutions, and how Data Engineering services support those solutions\nReview cloud technologies and participate in research efforts to best determine applicability as it pertains to Data Engineering services\nMentor junior team members\nEnsure all applicable security policies and processes are followed to support the organization's secure software development goals.\nRequired Qualifications\n8 or more years of experience developing enterprise-level solutions\n5 or more years building microservices and/or data processing systems\nBachelor's degree in Computer Science or a related field\nExperience with the Java programming language\nExperience with Amazon Web Services, or similar cloud offerings\nStrong testing automation experience, preferably in *unit frameworks\nAn equivalent combination of related education, training, and experience may be considered in place of the above qualifications\nYou're curious, passionate, authentic and accountable. These are our values and influence everything we do.\nPreferred Qualifications\nExperience with the Python programming language\nExperience building DevOps-enabled software solutions\nExperience with container management systems, such as Kubernetes\nExperience building streaming data processing systems\nUsage of Git, GitHub, GitLab, and/or Jenkins.\nThorough knowledge of additional AWS services (Lambda, Step Functions, ECR/ECS, SQS, SNS, OpenSearch, DynamoDB, etc.)\nExperience with relational databases and SQL language.\nWorld-Class Benefits\nHighlights include...\nComprehensive medical, prescription, dental and vision plans.\nMedical plan options include...\nPPO with low annual deductible and copays.\nHDHP combined with a health savings account with a contribution from SAS (no access to on-site health care center).\nOnsite Health Care Center (HQ) that's free to employees and family members enrolled in the PPO plan. There's a pharmacy too! Not local to HQ? The pharmacy will ship prescriptions for no additional charge!\nAn industry-leading 401k plan.\nGenerous time away including vacation time, a variety of paid holidays, and our much-loved U.S. Winter Wellness Break between December 25 and January 1.\nVolunteer Time Off, parental leave and unlimited paid sick days.\nGenerous childcare benefits for all full-time employees.\nDiverse and Inclusive\nAt SAS, it's not about fitting into our culture - it's about adding to it. We believe our people make the difference. Our diverse workforce brings together unique talents and inspires teams to create amazing software that reflects the diversity of our users and customers. Our commitment to diversity is a priority to our leadership, all the way up to the top; and it's essential to who we are. To put it plainly: you are welcome here.\nAdditional Information:\nTo qualify, applicants must be legally authorized to work in the United States, and should not require, now or in the future, sponsorship for employment visa status. SAS is an equal opportunity/Affirmative Action employer. All qualified applicants are considered for employment without regard to race, color, religion, gender, sexual orientation, gender identity, age, national origin, disability status, protected veteran status or any other characteristic protected by law. Read more: Know Your Rights. Also view the Pay Transparency notice.\nResumes may be considered in the order they are received. SAS employees performing certain job functions may require access to technology or software subject to export or import regulations. To comply with these regulations, SAS may obtain nationality or citizenship information from applicants for employment. SAS collects this information solely for trade law compliance purposes and does not use it to discriminate unfairly in the hiring process.\nSAS only sends emails from verified \"sas.com\" email addresses and never asks for sensitive, personal information or money. If you have any doubts about the authenticity of any type of communication from, or on behalf of SAS, please contact\n#SAS #highlightedjob",
    "id": "dice_c81dad63-c31e-4173-812a-146dc92f470d",
    "title": "Sr Software Development Engineer in Test"
  },
  {
    "company_link": "https://www.dice.com/company/RTX1db191?companyname=McKesson%20Corporation",
    "location": "Remote or Maryland, USA",
    "timestamp": "2024-07-18 22:18:35.959757",
    "posted_date": "Posted 22 hours ago",
    "employment_type": "Full-time",
    "company_image": "https://d3qscgr6xsioh.cloudfront.net/idew8PCT4GExkD3rG02w_transformed.png?format=webp",
    "company": "McKesson Corporation",
    "link": "https://www.dice.com/job-detail/c52e8c89-683a-40d4-a426-9881cdb218e5",
    "description": "McKesson is an impact-driven, Fortune 10 company that touches virtually every aspect of healthcare. We are known for delivering insights, products, and services that make quality care more accessible and affordable. Here, we focus on the health, happiness, and well-being of you and those we serve - we care.\nWhat you do at McKesson matters. We foster a culture where you can grow, make an impact, and are empowered to bring new ideas. Together, we thrive as we shape the future of health for patients, our communities, and our people. If you want to be part of tomorrow's health today, we want to hear from you.\nCoverMyMeds, part of McKesson Corporation, is a fast-growing healthcare technology company that has been recognized as a \"Best Place to Work\" by Glassdoor and a \"Best Company to Work For\" by FORTUNE. Through innovation and collaboration, CoverMyMeds' solutions help people get the medicine they need to live healthier lives by seamlessly connecting the healthcare network to improve medication access; thereby increasing speed to therapy and reducing prescription abandonment. CoverMyMeds' network includes 75 percent of electronic health record systems (EHRs), 50,000+ pharmacies, 750,000 providers and most health plans and PBMs.  Visit for more information.\nPosition Description:\nAs a\nSoftware Support Engineer\nfor CoverMyMeds, you will use your skills to troubleshoot, analyze, design, deploy, program, debug and modify computer programs for commercial or end-user applications for McKesson and their customers.  This role acts as the first line of defense for triaging customer support issues, technical software deployment and assignments in addition to continuing to evolve and grow existing software programs.  You will analyze and investigate applications engineering tasks and prepare design specifications, analysis, and recommendations, ensure that system improvements are successfully implemented and monitored to increase efficiency.\nOn occasion, you may also be relied upon to complete tasks and other related projects/functions outside your primary position. Making sure CoverMyMeds employees have diverse roles has been the backbone of our company's success. Establishing departmental links across the CoverMyMeds organization (Support, Engineering, Project Management, Software and Production) are key to your success in this position.\nINCUMBENT MUST LIVE WITHIN A COMMUTABLE DISTANCE OF FREDRICK, MARYLAND, as this position offers on-site and on-call client support including over some weekends, evenings and holidays.\nWe are unable to provide sponsorship now or in the future for this opportunity.\nWe are not working with staffing agencies to fill this position.\nKey Responsibilities:\nProvide engineering support and service leadership to the organizations' efforts to resolve complex customer technical issues. Diagnose if issues are related to: application defects, database defects, server/domain/client environment or hardware issues\nWork with existing system software / code currently developed\nWork on system wide mechanical and software during start-up - Expected to organize and direct the transition from start-up thru warranty period to support/maintenance contract\nArchive all internal machine functional specifications and hardware architectures for service reference\nSupporting onsite troubleshooting with the assistance from a remotely located developer\nAlign and streamline documentation protocols\nDocument activities in databases (JIRA, WIKI, STASH) and author knowledge base documentation on troubleshooting issues related to software products and hardware devices, and work with the training/documentation team to aid in knowledge sharing\nActively participate in cross functional teams that may include Software Engineering, Product Management and Hardware Engineering on feature design and requirements\nParticipate in on site meetings to help in resolving problems of high severity and to manage customer and vendor relationships from a support standpoint\nDevelop & assist with proper project management procedures\nProgram interfacing with McKesson R&D programs\nMinimum Requirements\nBachelor's degree or equivalent experience in diagnosing and troubleshooting software and hardware automation, and 4+ years' experience providing technical support and/or in-field work within Software Development.\nCritical Skills\nExperience writing queries and reports in relational databases (MariaDB or SQL Server)\nC# and/or Java programming experience required\n.NET technology experience\nMust have experience in a customer facing role with strong written and verbal communication skills\nExperience providing technical support and guidance to product support teams, software engineers and onsite technicians\nGood understanding of Microsoft Windows and Windows domains, servers, workstations, printers and firewalls\nExperience with troubleshooting software and hardware issues remotely is a must\nIn-depth knowledge of the diagnosis, repair & debugging of software & hardware automation\nAble to work independently\nProblem-solving aptitude\nPreferred Skills\nKnowledge of Automated refill centers and pharmacy management systems\nIn-depth knowledge of the diagnosis, repair & debugging of software & hardware automation (PLC experience)\nTechnical writing experience\nDevOps experience\nKnowledge of local networking, including Ethernet and TCP/IP configuration\nComputer hardware, networking and communication knowledge\nPrior Software Engineer Field Service Support experience\nPrior Technical Leadership experience\nWorking Conditions\nEnvironment is pharmaceutical mail order / distribution plant; some time as 'work from home' possible\nMust be authorized to work in the U.S.; Sponsorship is not available for this position\nPhysical Requirements\nMust live within a commutable distance to Frederick Maryland area\nMay need to stand and crouch for extended periods while troubleshooting machines / equipment\nAbility to travel locally as needed up to 50-60% (commuting to customer site)\nAbility to work on-call support over weekends, evenings, and holidays\nWe are proud to offer a competitive compensation package at McKesson as part of our Total Rewards. This is determined by several factors, including performance, experience and skills, equity, regular job market evaluations, and geographical markets. In addition to base pay, other compensation, such as an annual bonus or long-term incentive opportunities may be offered. For more information regarding benefits at McKesson, please click here.\nOur Base Pay Range for this position\n$105,200 - $175,300\nMcKesson is an Equal Opportunity Employer\nMcKesson provides equal employment opportunities to applicants and employees and is committed to a diverse and inclusive environment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, age or genetic information. For additional information on McKesson's full Equal Employment Opportunity policies, visit our Equal Employment Opportunity page.\nJoin us at McKesson!",
    "id": "dice_c52e8c89-683a-40d4-a426-9881cdb218e5",
    "title": "Software Support Engineer"
  },
  {
    "company_link": "https://www.dice.com/company/SCNCAPI2?companyname=Leidos",
    "location": "Remote",
    "timestamp": "2024-07-18 22:12:43.187322",
    "posted_date": "Posted moments ago",
    "employment_type": "Full-time",
    "company_image": "https://d3qscgr6xsioh.cloudfront.net/y1mIeuNGSBehxTUsLyY6_transformed.png?format=webp",
    "company": "Leidos",
    "link": "https://www.dice.com/job-detail/42e5777b-f401-4a89-9152-1a6c54bb9a5d",
    "description": "Description\nLooking for an exciting opportunity to make an impact as a full stack Software Engineer?\n1901 Group (A Leidos Company) has an exciting Senior Software Engineer position located in Southwest Virginia with opportunities to work remotely.\nPOSITION SUMMARY:\nOur new Software Engineer will support and modernize cloud applications for the ATF contract. This contract includes major feature additions to the currently migrated applications, production support, testing, deployment, and release management leveraging DevSecOps processes.\nPRIMARY RESPONSIBILITIES\nAfter your initial onboarding and acclimation to the team, you will work with a team of highly skilled software developers, engineers and QA analysts responsible for delivering customized solutions for federal and commercial clients.\nParticipate in design, development, testing, and release of key functionality for large scale custom software projects to meet customer requirements\nYou will work to develop core functionality for existing systems, create and execute unit tests, and assist with deployment of new software to the user community.\nAnalyze, diagnose, and resolve software bugs utilizing approved procedures following software best practices\nWork prioritized tasks from implementation through test and deployment during each Agile Sprint period.\nCollaborate with other software developers, QA analysts, operations staff, supervisors, and clients\nProvide technical leadership for the UI/UX team while developing features; identify technical requirements, estimate level of effort, collaborate cross-team with other technical leaders; mentor junior team members.\nProvide technical expertise and consulting to project leadership, tactical and strategic recommendations, risk assessment and management approaches to ensure development activities proceed as needed.\nBASIC QUALIFICATIONS:\nA full stack software developer with a Bachelors' degree and 4+ years or a Master's degree with 2+ years of experience developing and supporting software applications\nStrong knowledge of programming languages, development methodologies, and best practices\nA developer that is proficient in the practical application of programming languages such as React, Angular JS, Vue, JavaScript, Node JS, HTML/CSS, Bash, etc.\nExperience working with UI/UX designer, methodology, tools; collaborative refinement and implementing to defined specifications; previous cross browser development experience\nExperience with Microservices, RESTful APIs, GraphQL, JSON\nIn-depth knowledge of relational databases, database design data modeling with SQL and NoSQL\nResponsible for researching technical issues and provide a clear path to resolution with strong problem-solving and analytical skills\nExperienced in Agile and Scrum development methodologies and processes\nKnowledge of cloud computing platforms, such as AWS and Azure.\nPrevious experience with code reviews and mentoring\nExcellent written/verbal communication.\nship required.\nAbility to obtain and maintain a Public Trust security clearance (which includes three years of immediate residency in the US).\nPREFERRED QUALIFICATIONS:\nExperience with cloud technology environments\nExperience with best practices for creating a secure software application\nExperience with Java EE, AJAX, SOAP\nOriginal Posting Date:\n2024-07-18\nWhile subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.\nPay Range:\nPay Range $81,250.00 - $146,875.00\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.\n#Remote",
    "id": "dice_42e5777b-f401-4a89-9152-1a6c54bb9a5d",
    "title": "Software Engineer"
  },
  {
    "company_link": "https://www.dice.com/company/cxhlnc?companyname=Yoh%20-%20A%20Day%20%26%20Zimmerman%20Company",
    "location": "Remote or San Bruno, California, USA",
    "timestamp": "2024-07-18 22:18:36.779652",
    "posted_date": "Posted 6 hours ago",
    "employment_type": "Full-time",
    "company_image": "https://d3qscgr6xsioh.cloudfront.net/WieLG74uTrWnsRB8I5ud_0a3f6c37697252d795992679076a2678.png?format=webp",
    "company": "Yoh - A Day & Zimmerman Company",
    "link": "https://www.dice.com/job-detail/1a56161f-0975-4951-b32e-25e2d0b72b47",
    "description": "Python Developer   Data analysis tool\nDeveloping tool to analyze video and audio time series data using Numpy, SciKit, and reporting via Matplotlib.  Data is in JSON format.\nRequired:\nStrong object-oriented Python\nAt least some of the following; Numpy, SciPy, SciKit, reporting using Matplotlib\nDesired:\nAny experience with audio/video time series data is a plus\nJSON\nEstimated Min Rate\n: $59.50\nEstimated Max Rate\n: $85.00\nNote: Any pay ranges displayed are estimations.  Actual pay is determined by an applicant's experience, technical expertise, and other qualifications as listed in the job description.  All qualified applicants are welcome to apply.\nYoh, a Day & Zimmermann company, is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\nVisit\nto contact us if you are an individual with a disability and require accommodation in the application process.",
    "id": "dice_1a56161f-0975-4951-b32e-25e2d0b72b47",
    "title": "Python Developer - Data analysis tool"
  },
  {
    "company_link": "https://www.dice.com/company/91113390?companyname=Jobot",
    "location": "Remote or Toronto, Ohio, USA",
    "timestamp": "2024-07-18 22:18:37.136811",
    "posted_date": "Posted 9 hours ago",
    "employment_type": "Full-time",
    "company_image": "https://d3qscgr6xsioh.cloudfront.net/RVkPsbuFScmLFloqItyr_transformed.png?format=webp",
    "company": "Jobot",
    "link": "https://www.dice.com/job-detail/0d5b0bbc-65cc-4c55-8639-10b81bf3f643",
    "description": "100% Remote - Gaming Industry - Be a part of something special!\nThis Jobot Job is hosted by: Katherine Krull\nAre you a fit? Easy Apply now by clicking the \"Apply Now\" button and sending us your resume.\nSalary: $70,000 - $110,000 per year\nA bit about us:\n100% Remote - Gaming Industry - Be a part of something special!\nJob Title: Computer Scientist/Mathematician\nJob Location: 100% REMOTE (*Must reside in Eastern Canada, i.e. Montreal, Toronto, Moncton, Nova Scotia, Quebec, etc.)\nSalary: $70k-$110k base salary + Comprehensive Benefits\nRequirements:\n- Currently, working as a Software Engineer\n- Deep love of Mathematics\n- Python and/or C++\nNice-to-Haves:\n- Casino Gaming background\nWhy join us?\nBe one of us at the best global professional service firms in the world!\nFlexible Working Environment\nPaid Time Off\n401k\nExcellent Benefits\nChallenging problems to work on\nJob Details\nGet ready to level up your career with this exciting opportunity! Our organization is a leading player in the technology industry, renowned for our innovative gaming solutions. We are looking for a passionate and talented individual to join our dynamic team. This role is perfect for someone who is passionate about gaming, has a deep understanding of computer science, and is ready to use their skills in a fast-paced, challenging, and rewarding environment. As a Permanent Gaming Computer Scientist, you will be at the forefront of creating, testing, and implementing gaming solutions that will captivate our users and drive our success.are Engineer develops, maintains, and enhances complex and diverse software systems (e.g., processing-intensive analytics, novel algorithm development, manipulation of extremely large data sets, real-time systems, and business management information systems) based upon documented requirements. Works individually or as part of a team. Reviews and tests software components for adherence to the design requirements and documents test results. Resolves software problem reports. Utilizes software development and software design methodologies appropriate to the development environment. Provides specific input to the software components of system design to include hardware/software trade-offs, software reuse, use of Commercial Off-the-shelf (COTS)/Government Off- the-shelf (GOTS) in place of new development, and requirements analysis and synthesis from system level to individual software components.\nRequirements:\n- Currently, working as a Software Engineer\n- Deep love of Mathematics\n- Python and/or C++\nNice-to-Haves:\n- Casino Gaming background\nInterested in hearing more? Easy Apply now by clicking the \"Apply Now\" button.",
    "id": "dice_0d5b0bbc-65cc-4c55-8639-10b81bf3f643",
    "title": "Computer Scientist/Mathematician (REMOTE)"
  },
  {
    "company_link": "https://www.dice.com/company/RTX1661d2?companyname=Marriott%20International",
    "location": "Remote or Bethesda, Maryland, USA",
    "timestamp": "2024-07-18 22:12:43.232595",
    "posted_date": "Posted 10 hours ago",
    "employment_type": "Full-time",
    "company_image": "https://d3qscgr6xsioh.cloudfront.net/GDaW7Q9NRgf1zYaXDzuQ_transformed.png?format=webp",
    "company": "Marriott International",
    "link": "https://www.dice.com/job-detail/fced6821-64dc-4beb-9066-1875119c6fe9",
    "description": "Job Number\n24124038\nJob Category\nInformation Technology\nLocation\nMarriott International HQ, 7750 Wisconsin Avenue, Bethesda, Maryland, United States VIEW ON MAP\nSchedule\nFull-Time\nLocated Remotely?\nY\nRelocation?\nN\nPosition Type\nManagement\nAbout Us\nMarriott is a world leader in hospitality. Offering the most powerful portfolio in the industry, our 31 brands and 8,500+ properties across 138 countries and territories give people more ways to connect, experience and expand their world. Diversity and inclusion are fundamental to our core values and strategic business goals. Taking care of people and their well-being is our most precious cultural inheritance.\nJob Overview\nAs a Java, Full stack and AEM Software Engineer at Marriott, you will be working on a state of the art React based micro-ui architecture, utilizing AEM as the CMS and a Java based services. You will help build the next generation hospitality web portal to assist our customers in traveling the world for work and pleasure. You will work with product owners, UX, back-end/front-end engineers and QA engineering to build scalable web software that performs well on all modern web browsers and devices.\nKey Responsibilities\nProven experience in Java development, with a strong understanding of J2EE concepts and best practices\nExperience designing scalable microservices\nProficiency in designing and implementing Microservices using frameworks like Spring Boot, Spring Webflux\nCollaborate with cross-functional teams to design and implement user-friendly features for all form factors.\nPrior experience in a leadership or lead developer role, with the ability to guide and mentor junior team members\nOptimize applications for maximum speed and scalability.\nEnsure the technical feasibility of UI/UX designs. Be ready to propose alternative solutions.\nParticipate in code reviews to maintain code quality and consistency.\nTroubleshoot and debug issues as they arise.\nStay up to date with the latest front-end technologies and best practices.\nCommunicate effectively with team members, stakeholders, and clients.\nQualifications\nBachelor's degree in computer science, Software Engineering, or a related field preferred (or equivalent experience).\n5+ years of professional experience in Java development, Spring Boot, Spring Web flux.\n3+ years of professional experience in AEM 6.1+ development\nStrong fundamentals in data modelling and database normalization\nStrong proficiency in Java and supporting Java frameworks like spring boot.\nStrong proficiency in AEM development including services, Adobe integrations and components.\nSolid understanding of web markup, including HTML5 and CSS3.\nExperience with state management libraries like Redux, Mobx, Zustand.\nKnowledge of NGINX web servers and routing configurations.\nExcellent problem-solving skills and attention to detail.\nEffective communication and teamwork skills.\nExperience with monitoring tools like Dynatrace, Splunk, et al.\nProven ability to work in an Agile development environment.\nExperience with RESTful APIs and asynchronous programming.\nFamiliarity with version control systems (e.g., Git).\nPreferred Qualifications\nExperience providing a headless AEM integration for cross channel renderer applications.\nExperience with GraphQL\nExperience with server-side rendering (SSR) and Next.js.\nExperience with Micro-UI architecture patterns.\nFamiliarity with testing frameworks.\nKnowledge of UI/UX design principles.\nExperience with responsive design and mobile-first development.\nContributions to open-source projects or a strong GitHub profile.\nWhy Marriott\nCompetitive salary, bonus, and benefits package.\nOpportunity to work on innovative projects and technologies.\nCollaborative and inclusive work environment.\nProfessional growth and development opportunities.\nFlexible work schedule and remote work options.\nTravel and hospitality tech is fun, and it's a good mission.\nCalifornia Applicants Only\n: The salary range for this position is $83,550 to $178,603 annually.\nColorado Applicants Only\n: The salary range for this position is $83,550 to $162,366 annually.\nHawaii Applicants Only\n: The salary range for this position is $101,096 to $178,603 annually.\nNew York Applicants Only\n: The salary range for this position is $83,550 to $178,603 annually.\nWashington, D.C. Applicants Only\n: The salary range for this position is $91,905 to $162,366 annually.\nWashington Applicants Only\n: The salary range for this position is $83,550 to $178,603 annually. In addition to the annual salary, the position will be eligible to receive an annual bonus. Employees will accrue 0.04616 PTO balance for every hour worked and eligible to receive minimum of 7 holidays annually.\nAll locations offer coverage for medical, dental, vision, health care flexible spending account, dependent care flexible spending account, life insurance, disability insurance, accident insurance, adoption expense reimbursements, paid parental leave, educational assistance, 401(k) plan, stock purchase plan, discounts at Marriott properties, commuter benefits, employee assistance plan, and childcare discounts. Benefits are subject to terms and conditions, which may include rules regarding eligibility, enrolment, waiting period, contribution, benefit limits, election changes, benefit exclusions, and others.\nMarriott HQ is committed to a hybrid work environment that enables associates to Be connected. Headquarters-based positions are considered hybrid, for candidates within a commuting distance to Bethesda, MD; candidates outside of commuting distance to Bethesda, MD will be considered for Remote positions.\nThe application deadline for this position is 28 days after the date of this posting, July 17, 2024.\nMarriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law.\nMarriott International is the world's largest hotel company, with more brands, more hotels and more opportunities for associates to grow and succeed.\nBe\nwhere you can do your best work,\nbegin\nyour purpose,\nbelong\nto an amazing global team, and\nbecome\nthe best version of you.",
    "id": "dice_fced6821-64dc-4beb-9066-1875119c6fe9",
    "title": "Software Engineer"
  },
  {
    "company_link": "https://www.dice.com/company/kforcecx?companyname=Kforce%20Technology%20Staffing",
    "location": "Remote or Charles Town, West Virginia, USA",
    "timestamp": "2024-07-18 22:12:43.207012",
    "posted_date": "Posted 5 hours ago",
    "employment_type": "Full-time",
    "company_image": "https://d3qscgr6xsioh.cloudfront.net/SBskFuOJRmypzE9vYhWQ_logo2.png?format=webp",
    "company": "Kforce Technology Staffing",
    "link": "https://www.dice.com/job-detail/a80f597e-7c0a-4f4d-9c77-e98304b97c5b",
    "description": "RESPONSIBILITIES:\nKforce's client is looking to add a Senior Software Engineer to their team. This role requites Sitefinity 15 and can be performed on a 100% remote basis from anywhere in the United States.\nSummary:\nThis role focuses on Full Stack (CMS) development and will provide solution design, development, and support of applications and environments steeped in .NET, Angular, NodeJS, REST API's and SQL Server by helping to launch and support our client's next generation CMS digital platform.\nResponsibilities:\n* Senior Software Engineer designs, develops, and implements effective, intuitive user interfaces for Web applications, APIs, and Web properties\n* Provides technical solutions and innovative ideas to the business and internal clients\n* Understands browser specific compatibility issues as well as the benefits of the various design methodologies\n* Researches and remains current on industry trends relating to Web accessibility, usability, and emerging technologies to drive and evangelize best practices\n* Responds rapidly to continuous changes and troubleshoots issues as they arise\n* Demonstrates expert knowledge in Web presentation technologies (e.g., REST, JSON, XML)\n* As a Senior Software Engineer, you will translate design requirements and specifications into robust high quality code implementations\n* Performs code unit tests and demonstrates the ability to properly validate functionality of work produced\n* Writes and maintains computer code, programs, and specifications documentation\n* Communicates the status of projects regularly and in a clear and concise way\n* Works independently with limited supervision as well as within a team environment\n* Performs other tasks as assigned\nREQUIREMENTS:\n* Overall 6+ years of experience developing web applications on the Microsoft technology stack using C# and JavaScript\n* 3+ years of experience developing traditional and headless content management systems (CMS), such as Sitecore and Sitefinity\n* 3+ years of experience with JavaScript frameworks with React, Vue.js, or Angular, creating, and consuming RESTful, OData and SOAP based Web Services, JavaScript Object Notification (JSON), XML, and interface design\n* Experience developing utilizing DevOps/Agile SDLC, Testing, and CI/CD required\n* Experience with mobile Web Development (HTML5, Bootstrap, jQuery Mobile)\n* Experience integrating and analyzing google analytics\n* Expertise with debugging code, triaging issues, and providing customer experience enhancing solutions\n* Experience with multiple back-end languages (e.g., C#, Java, Python) and JavaScript frameworks (e.g., Angular, React, Node.js, jQuery), specifically with .NET Core\n* Experience with Sitefinity 15 is required\n* Advanced hands-on experience delivering and implementing a cloud-based CMS\n* Experience with Object-Oriented Programming and latest .NET Core versions\n* Understanding the importance of applying taxonomy rules will be necessary to organize and classify content\n* Solid knowledge of multiple front-end languages and libraries (e.g., HTML/ CSS, JavaScript, XML)\n* Solid experience with front-end bundling/compilers (e.g., Gulp, Webpack, Rollup)\n* Experience with databases (e.g., SQL Server, MySQL, MongoDB), web servers (e.g., IIS, Apache) and UI/UX design\n* Ability to develop with Web Content Management Systems (CMS), Responsive Web development skills\n* Ability to follow Web accessibility (Section 508 and Web Accessibility Initiative (WAI)) standards\n* Understanding of common User Experience (UX)/User Interface (UI) design patterns, best practices, and standard conventions\n* Analytical, organizational skills and attention to detail\nThe pay range is the lowest to highest compensation we reasonably in good faith believe we would pay at posting for this role. We may ultimately pay more or less than this range. Employee pay is based on factors like relevant education, qualifications, certifications, experience, skills, seniority, location, performance, union contract and business needs. This range may be modified in the future.\nWe offer comprehensive benefits including medical/dental/vision insurance, HSA, FSA, 401(k), and life, disability & ADD insurance to eligible employees. Salaried personnel receive paid time off. Hourly employees are not eligible for paid time off unless required by law. Hourly employees on a Service Contract Act project are eligible for paid sick leave.\nNote: Pay is not considered compensation until it is earned, vested and determinable. The amount and availability of any compensation remains in Kforce's sole discretion unless and until paid and may be modified in its discretion consistent with the law.\nThis job is not eligible for bonuses, incentives or commissions.\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.",
    "id": "dice_a80f597e-7c0a-4f4d-9c77-e98304b97c5b",
    "title": "Senior Software Engineer - Full Stack / Sitefinity"
  }
]
